MyProject/src/Documents/Чек/Чек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Чек</name>
  <basedOn>Document.Заказ</basedOn>
  <registerRecords>AccumulationRegister.Выручка</registerRecords>
  <attributes>
    <name>СчетНачисления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетСписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЗаказа</name>
    <attributes>
      <name>ПозицияМеню</name>
      <type>
        <types>CatalogRef.Меню</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоПоПозицииМеню</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyProject/src/AccumulationRegisters/Выручка/Выручка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Выручка</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПозицияМеню</name>
    <type>
      <types>CatalogRef.Меню</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

MyProject/src/Documents/Чек/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр Выручка
	Движения.Выручка.Записывать = Истина;
	Для Каждого ТекСтрокаСоставЗаказа из СоставЗаказа Цикл
		Движение = Движения.Выручка.Добавить();
		Движение.Период = Дата;
		Движение.ПозицияМеню = ТекСтрокаСоставЗаказа.ПозицияМеню;
		Движение.Сумма = ТекСтрокаСоставЗаказа.ИтогоПоПозицииМеню;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заказ") Тогда
		
		Для Каждого ТекСтрокаСоставЗаказа из ДанныеЗаполнения.СоставЗаказа Цикл
			НоваяСтрока = СоставЗаказа.Добавить();
			НоваяСтрока.ПозицияМеню = ТекСтрокаСоставЗаказа.СтатьяЗаказа;
			НоваяСтрока.Количество = ТекСтрокаСоставЗаказа.Количество;
			НоваяСтрока.Цена = ТекСтрокаСоставЗаказа.СтатьяЗаказа.ЦенаТовара;
			НоваяСтрока.ИтогоПоПозицииМеню = НоваяСтрока.Цена * НоваяСтрока.Количество;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
